app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 4]]
---
    <div class="body"><%= post.body %></div>
    <div class="comments"><small><%= link_to "#{post.comments.count} Komentar", post %></small></div>