app/views/posts/show.html.erb

<h4>Komentar</h4>
<% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 4]]