app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "comments" ("author", "body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "anonym"], ["body", "coba coba yuk"], ["created_at", "2014-10-07 07:43:23.772122"], ["post_id", 4], ["updated_at", "2014-10-07 07:43:23.772122"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:author, :body))