app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Hello World"], ["created_at", "2014-10-07 03:13:24.688489"], ["title", "Coba"], ["updated_at", "2014-10-07 03:13:24.688489"]]
---
  def create
    @post = Post.new(post_params)
    @post.save

SELECT  "posts".* FROM "posts"   ORDER BY created_at DESC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
      @posts = Post.all.order('created_at DESC').paginate(page:params[:page], per_page: 2)